# [SQLPY-49] 5. Музыкальный сервис
# к лекции «Группировки, выборки из нескольких таблиц» 25.03.2022


def get_data():
    data_list = [
        {'task': '--1. ЖАНРЫ:   не менее 5 жанров',
         'select': """
            INSERT INTO music_genres 
                (genre_id, genre_name)
            VALUES
                (1, 'жанр-1') , 
                (2, 'жанр-2') ,
                (3, 'жанр-3') , 
                (4, 'жанр-4') ,
                (5, 'жанр-5') ;
        """},
        {'task': '--2. СБОРНИКИ:   не менее 8 сборников',
         'select': """
            INSERT INTO music_collections 
                (collection_id, collection_name, collection_release_year)
            VALUES
                (1, 'сборник-1', 2020) , 
                (2, 'сборник-2', 2022) ,  
                (3, 'сборник-3', 2013) ,
                (4, 'сборник-4', 2014) ,  
                (5, 'сборник-5', 2015) ,
                (6, 'сборник-6', 2016) ,  
                (7, 'сборник-7', 2017) ,
                (8, 'сборник-8', 2018) ;
        """},
        {'task': '--3. ИСПОЛНИТЕЛИ:   не менее 8 исполнителей',
         'select': """
            INSERT INTO music_artists 
                (artist_id, artist_name)
            VALUES
                (1, ' исполнитель-1') , 
                (2, 'исполнитель-2 new') ,  
                (3, 'исполнитель-3') ,
                (4, 'исполнитель-4 new') ,  
                (5, 'исполнитель-5') ,
                (6, 'исполнитель-6 new') ,  
                (7, 'исполнитель-7') ,
                (8, 'исполнитель-8 new') ;
        """},
        {'task': '--4. АЛЬБОМЫ:   не менее 8 альбомов',
         'select': """
            INSERT INTO music_albums 
                (album_id, album_name, album_release_year)
            VALUES
                (1, 'альбом-1', 2020) , 
                (2, 'альбом-2', 2022) ,  
                (3, 'альбом-3', 2013) ,
                (4, 'альбом-4', 2014) ,  
                (5, 'альбом-5', 2015) ,
                (6, 'альбом-6', 2016) ,  
                (7, 'альбом-7', 2017) ,
                (8, 'альбом-8', 2018) ;
        """},
        {'task': '--5. ТРЕКИ:   не менее 15 треков',
         'select': """
            INSERT INTO music_tracks 
                (track_id, track_name, track_duration, album_id)
            VALUES
                (1, 'трек-1', 212, 1) , 
                (2, ' трек-2', 222, 2) ,  
                (3, 'трек-3', 233, 2) ,
                (4, 'трек-4', 244, 4) ,  
                (5, 'мой трек-5', 255, 5) ,
                (6, 'трек-6', 266, 5) ,  
                (7, 'мой', 212, 7) ,
                (8, 'трек-8', 288, 8) ,
                (9, 'трек-2', 312, 7) , 
                (10, 'my трек-2', 322, 6) ,  
                (11, 'трек-3', 333, 5) ,
                (12, 'немой трек-4', 344, 4) ,  
                (13, 'трек-5', 355, 3) ,
                (14, 'трек-6', 366, 2) ,  
                (15, 'трек-7', 377, 1) ;
        """},
        {'task': '--6. ТРЕКИ и СБОРКИ:  многие-ко-многим',
         'select': """
            INSERT INTO relate_track_into_collection 
                (collection_id, track_id)
            VALUES
                (1, 1) , 
                (2, 2) ,  
                (3, 3) ,
                (4, 4) ,  
                (5, 5) ,
                (6, 6) ,  
                (7, 7) ,
                (8, 1) , 
                (7, 2) ,  
                (6, 3) ,
                (5, 4) ,  
                (4, 5) ,
                (3, 6) ,  
                (2, 7) ,  
                (1, 8) ;
        """},
        {'task': '--7. АРТИСТЫ и АЛЬБОМЫ:  многие-ко-многим',
         'select': """
            INSERT INTO relate_artist_into_album 
                (album_id, artist_id)
            VALUES
                (8, 1) , 
                (7, 2) ,  
                (6, 3) ,
                (5, 4) ,  
                (4, 5) ,
                (3, 6) ,  
                (2, 7) ,  
                (1, 8) ,
                (5, 7) ,
                (6, 6) ,  
                (6, 5) ,  
                (7, 4) ;
        """},
        {'task': '--8. ЖАНРЫ иАРТИСТЫ:  многие-ко-многим',
         'select': """
            INSERT INTO relate_genre_into_artist 
                (genre_id, artist_id)
            VALUES
                (1, 1) , 
                (2, 2) ,  
                (3, 3) ,
                (4, 4) ,  
                (5, 5) ,
                (4, 6) ,  
                (3, 7) ,  
                (2, 8) ,  
                (3, 8) ,
                (4, 8) ,  
                (5, 7) ,  
                (1, 6) ;
        """}
    ]
    return data_list
